InformationRegisters/РСК_МатериальноОтветственныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>РСК_МатериальноОтветственныеЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РСК_МатериальноОтветственныеЛица/Ext/ManagerModule.bsl
Функция ПользовательЯвляетсяМатериальноОтветственнымЛицом(Склад, Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОтветственноеЛицо",Пользователь);
	Запрос.УстановитьПараметр("Склад",Склад);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РСК_МатериальноОтветственныеЛица.ОтветственноеЛицо КАК ОтветственноеЛицо
	|ИЗ
	|	РегистрСведений.РСК_МатериальноОтветственныеЛица КАК РСК_МатериальноОтветственныеЛица
	|ГДЕ
	|	РСК_МатериальноОтветственныеЛица.ОтветственноеЛицо = &ОтветственноеЛицо
	|	И РСК_МатериальноОтветственныеЛица.Склад = &Склад";  
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции    

Функция ДляСкладаУстановленоОграничениеПроведения(Склад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад",Склад);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РСК_МатериальноОтветственныеЛица.Склад КАК Склад
	|ИЗ
	|	РегистрСведений.РСК_МатериальноОтветственныеЛица КАК РСК_МатериальноОтветственныеЛица
	|ГДЕ
	|	РСК_МатериальноОтветственныеЛица.Склад = &Склад";
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции
